package com.company.yun.bean.function;

import java.util.List;

/**
 * Created by Lovelin on 2019/5/16
 * <p>
 * Describe:  industry
 */
public class PersonIndustryBean {
    /**
     * industry : {"city":{"x":["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"],"y":["一线城市","二线城市","三线城市"],"z":[["227","251","309","165","217","253","181","265","203","176","286","205","250","207"],["276","271","370","351","236","253","373","349","304","229","369","331","357","345"],["988","1004","1236","1034","908","1015","1067","1206","1015","882","1193","1143","1193","1151"]]},"sex":{"x":["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"],"y":["男","女"],"z":[["474","602","642","485","508","598","618","566","527","441","703","582","668","494"],["514","402","594","549","400","417","449","640","488","441","490","561","525","657"]]},"age":{"x":["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"],"y":["0-17","18-24","25-34","35-44","45+"],"z":[["59","50","24","20","63","30","64","12","60","70","83","45","11","34"],["79","150","123","93","72","81","128","168","91","88","95","114","155","161"],["474","481","618","496","408","487","490","639","477","414","644","525","548","598"],["306","251","395","258","272","274","330","337","274","255","310","354","334","345"],["70","72","76","167","93","143","55","50","113","55","61","105","145","13"]]}}
     */
    private IndustryEntity industry;

    public void setIndustry(IndustryEntity industry) {
        this.industry = industry;
    }

    public IndustryEntity getIndustry() {
        return industry;
    }

    public class IndustryEntity {
        /**
         * city : {"x":["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"],"y":["一线城市","二线城市","三线城市"],"z":[["227","251","309","165","217","253","181","265","203","176","286","205","250","207"],["276","271","370","351","236","253","373","349","304","229","369","331","357","345"],["988","1004","1236","1034","908","1015","1067","1206","1015","882","1193","1143","1193","1151"]]}
         * sex : {"x":["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"],"y":["男","女"],"z":[["474","602","642","485","508","598","618","566","527","441","703","582","668","494"],["514","402","594","549","400","417","449","640","488","441","490","561","525","657"]]}
         * age : {"x":["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"],"y":["0-17","18-24","25-34","35-44","45+"],"z":[["59","50","24","20","63","30","64","12","60","70","83","45","11","34"],["79","150","123","93","72","81","128","168","91","88","95","114","155","161"],["474","481","618","496","408","487","490","639","477","414","644","525","548","598"],["306","251","395","258","272","274","330","337","274","255","310","354","334","345"],["70","72","76","167","93","143","55","50","113","55","61","105","145","13"]]}
         */
        private CityEntity city;
        private SexEntity sex;
        private AgeEntity age;

        public void setCity(CityEntity city) {
            this.city = city;
        }

        public void setSex(SexEntity sex) {
            this.sex = sex;
        }

        public void setAge(AgeEntity age) {
            this.age = age;
        }

        public CityEntity getCity() {
            return city;
        }

        public SexEntity getSex() {
            return sex;
        }

        public AgeEntity getAge() {
            return age;
        }

        public class CityEntity {
            /**
             * x : ["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"]
             * y : ["一线城市","二线城市","三线城市"]
             * z : [["227","251","309","165","217","253","181","265","203","176","286","205","250","207"],["276","271","370","351","236","253","373","349","304","229","369","331","357","345"],["988","1004","1236","1034","908","1015","1067","1206","1015","882","1193","1143","1193","1151"]]
             */
            private List<String> x;
            private List<String> y;
            private List<List<String>> z;

            public void setX(List<String> x) {
                this.x = x;
            }

            public void setY(List<String> y) {
                this.y = y;
            }

            public void setZ(List<List<String>> z) {
                this.z = z;
            }

            public List<String> getX() {
                return x;
            }

            public List<String> getY() {
                return y;
            }

            public List<List<String>> getZ() {
                return z;
            }
        }

        public class SexEntity {
            /**
             * x : ["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"]
             * y : ["男","女"]
             * z : [["474","602","642","485","508","598","618","566","527","441","703","582","668","494"],["514","402","594","549","400","417","449","640","488","441","490","561","525","657"]]
             */
            private List<String> x;
            private List<String> y;
            private List<List<String>> z;

            public void setX(List<String> x) {
                this.x = x;
            }

            public void setY(List<String> y) {
                this.y = y;
            }

            public void setZ(List<List<String>> z) {
                this.z = z;
            }

            public List<String> getX() {
                return x;
            }

            public List<String> getY() {
                return y;
            }

            public List<List<String>> getZ() {
                return z;
            }
        }

        public class AgeEntity {
            /**
             * x : ["效率办公","生活实用","丽人母婴","图像","运动健康","生活服务","聊天社交","影音","新闻阅读","汽车","旅游","教育","购物","金融理财"]
             * y : ["0-17","18-24","25-34","35-44","45+"]
             * z : [["59","50","24","20","63","30","64","12","60","70","83","45","11","34"],["79","150","123","93","72","81","128","168","91","88","95","114","155","161"],["474","481","618","496","408","487","490","639","477","414","644","525","548","598"],["306","251","395","258","272","274","330","337","274","255","310","354","334","345"],["70","72","76","167","93","143","55","50","113","55","61","105","145","13"]]
             */
            private List<String> x;
            private List<String> y;
            private List<List<String>> z;

            public void setX(List<String> x) {
                this.x = x;
            }

            public void setY(List<String> y) {
                this.y = y;
            }

            public void setZ(List<List<String>> z) {
                this.z = z;
            }

            public List<String> getX() {
                return x;
            }

            public List<String> getY() {
                return y;
            }

            public List<List<String>> getZ() {
                return z;
            }
        }
    }
}
